app/Controllers/Dashboard.php

    public function index()
    {
        $mhsModel = new MahasiswaModel();
        $dsnModel = new DosenModel();
        $mkModel  = new MatkulModel();

        $avgNilai = $this->db->query(
            "SELECT AVG(nilai_akhir) as avg_nilai FROM nilai"
        )->getRowArray();

        $rekapIpk = $this->db->query(
            "SELECT * FROM v_rekap_ipk"
        )->getResultArray();

        $data = [
            'mhs'       => $mhsModel->countAll(),
            'dsn'       => $dsnModel->countAll(),
---
SELECT COUNT(*) AS `numrows` FROM `dosen`