app/Controllers/Mahasiswa.php

    public function index()
    {
        $data['mahasiswa'] = $this->db->table('mahasiswa')->get()->getResultArray();
---
SELECT *
FROM `mahasiswa`

    public function simpan()
    {
    $data = [
        'nim' => $this->request->getPost('nim'),
        'nama_mahasiswa' => $this->request->getPost('nama_mahasiswa'),
        'angkatan' => $this->request->getPost('angkatan'),
    ];

    $this->db->table('mahasiswa')->insert($data);
---
INSERT INTO `mahasiswa` (`nim`, `nama_mahasiswa`, `angkatan`) VALUES ('2405121', 'Sonya Azizah', '2025')

    public function edit($nim)
    {
    $data['mahasiswa'] = $this->db->table('mahasiswa')
        ->where('nim', $nim)
        ->get()
        ->getRowArray();
---
SELECT *
FROM `mahasiswa`
WHERE `nim` = '2405154'

    public function update($nim)
    {
    $data = [
        'nama_mahasiswa' => $this->request->getPost('nama_mahasiswa'),
        'angkatan' => $this->request->getPost('angkatan'),
    ];

    $this->db->table('mahasiswa')
        ->where('nim', $nim)
        ->update($data);
---
UPDATE `mahasiswa` SET `nama_mahasiswa` = 'Fatimah Azzahra', `angkatan` = '2025'
WHERE `nim` = '2405154'