app/Controllers/Transkrip.php

    public function index()
    {
        $data['mahasiswa'] = $this->db->table('mahasiswa')->get()->getResultArray();
---
SELECT *
FROM `mahasiswa`